NB: Do not write queries for the questions below. Use numpy, pandas, matplotlib and searborn. The only query you should have is to join the two tables in pd.read_sql

Questions: 
1. Create a new column for selling_price that is taking a 25% markup from the original buying_price column. This should be something like new_sp = buying_price*1.25. Use this new column moving forward for selling price, not the original
2. Create a new column for profit that is now using the new_sp column. Use this new profit column moving forward.
3. Display the total sales ever made in the duka.
4. Display the top 5 products of the business, in terms of sales.
5. Display the best performing month in the business in terms of sales
6. Graph the sales of each of the products ordered. 
7. What is the correlation value between the buying_price and profit?
8. If possible, what is the correlation between product_name and profit?
9. Graph the monthly sales.
10. Clean up the unused columns like the old selling price and profit, then dump a csv file of the clean dataset. Ensure the output is called duka_sales_cleaned.csv


Once this is done, you push on your Github repository. You are allowed to discuss.

In [1]:
# install pandas and import the package(s)
import pandas as pd

In [2]:
# install sqlalchemy
from sqlalchemy import create_engine as ce

In [3]:
#connect to db
engine=ce("postgresql://postgres:Mamamia11@localhost:5432/myduka")

In [4]:
#select all from products
df=pd.read_sql("select * from products",engine)

In [7]:
#display the results
df

      id                    name  buying_price  selling_price  stock_quantity
0      1                blueband         200.0          210.0              50
1      2                    kiwi         150.0          170.0              50
2      3               broadways          60.0           70.0              50
3      4               superloaf          55.0           65.0              50
4      5                  lotion         200.0          250.0              50
..   ...                     ...           ...            ...             ...
102  103  Lobster - Baby, Boiled           5.0           44.0              67
103  104        Pate Pans Yellow          20.0           55.0              54
104  105         Skirt - 24 Foot          24.0            6.0              85
105  106          Chambord Royal           8.0           60.0              71
106  107  Lamb - Racks, Frenched           6.0           64.0              91

[107 rows x 5 columns]

In [8]:
#add a new column with the new buying price
df['new_sp']=df['buying_price']*1.25

In [9]:
#display the results
df

,id,name,buying_price,selling_price,stock_quantity,new_sp
0,1,blueband,200.0,210.0,50,250.00
1,2,kiwi,150.0,170.0,50,187.50
2,3,broadways,60.0,70.0,50,75.00
3,4,superloaf,55.0,65.0,50,68.75
4,5,lotion,200.0,250.0,50,250.00
...,...,...,...,...,...,...
102,103,"Lobster - Baby, Boiled",5.0,44.0,67,6.25
103,104,Pate Pans Yellow,20.0,55.0,54,25.00
104,105,Skirt - 24 Foot,24.0,6.0,85,30.00
105,106,Chambord Royal,8.0,60.0,71,10.00
106,107,"Lamb - Racks, Frenched",6.0,64.0,91,7.50

In [10]:
#create a new column for profits that will use the new_sp values
df['profits']=df['new_sp']-df['selling_price']

In [11]:
#display the results
df

,id,name,buying_price,selling_price,stock_quantity,new_sp,profits
0,1,blueband,200.0,210.0,50,250.00,40.00
1,2,kiwi,150.0,170.0,50,187.50,17.50
2,3,broadways,60.0,70.0,50,75.00,5.00
3,4,superloaf,55.0,65.0,50,68.75,3.75
4,5,lotion,200.0,250.0,50,250.00,0.00
...,...,...,...,...,...,...,...
102,103,"Lobster - Baby, Boiled",5.0,44.0,67,6.25,-37.75
103,104,Pate Pans Yellow,20.0,55.0,54,25.00,-30.00
104,105,Skirt - 24 Foot,24.0,6.0,85,30.00,24.00
105,106,Chambord Royal,8.0,60.0,71,10.00,-50.00
106,107,"Lamb - Racks, Frenched",6.0,64.0,91,7.50,-56.50

In [12]:
# display the total sales
sales_df=pd.read_sql("select * from sales s join products p on p.id=s.pid",engine)

In [14]:
#display the results
sales_df

,id,pid,quantity,created_at,id,name,buying_price,selling_price,stock_quantity
0,3,85,5.0,2023-02-19 18:33:38,85,Pheasants - Whole,5.0,6.0,96
1,4,86,5.0,2023-09-07 08:05:52,86,Ecolab - Ster Bac,16.0,14.0,50
2,5,89,8.0,2022-12-27 05:39:33,89,Foam Tray S2,7.0,40.0,56
3,6,107,4.0,2022-12-19 07:46:31,107,"Lamb - Racks, Frenched",6.0,64.0,91
4,7,76,1.0,2023-10-04 22:37:56,76,Flavouring - Rum,30.0,99.0,92
...,...,...,...,...,...,...,...,...,...
95,98,81,9.0,2023-01-07 04:47:41,81,Sobe - Orange Carrot,8.0,64.0,76
96,99,93,6.0,2022-12-18 16:33:19,93,Mousse - Banana Chocolate,16.0,44.0,59
97,100,60,7.0,2023-03-10 15:48:48,60,"Soda Water - Club Soda, 355 Ml",5.0,65.0,85
98,101,106,7.0,2023-05-06 14:08:02,106,Chambord Royal,8.0,60.0,71
99,102,16,2.0,2023-05-27 17:16:53,16,Waffle Stix,10.0,21.0,59

In [16]:
#calculate total sales (money)
total_sales=(sales_df['quantity']*sales_df['selling_price'])

total_sales.sum()

31669.0

In [17]:
#calculate total sales (quantity)
sales_df['quantity'].sum()

521.0

In [24]:
#Display the top 5 products of the business, in terms of sales (quantity)
sales_df=pd.read_sql("select s.pid,p.name, SUM(s.quantity) as total_quantity from sales s join products p on p.id=s.pid GROUP BY pid, name ORDER BY total_quantity DESC ",engine)

In [25]:
sales_df.head()

   pid             name  total_quantity
0  106   Chambord Royal            26.0
1   14  Wine - Rubyport            24.0
2   77  Extract - Lemon            20.0
3   75     Shark - Loin            16.0
4   63   Bread - Burger            16.0

In [31]:
#Display the top 5 products of the business, in terms of sales (revenue)
rev=[]
# loop through the products table using the profit and quantity from sales to find the best performing product 
for product in df:
    print(product)
df
#     pid = int(product['id'])
#     for sale in sales_df:
#         p_id = int(sale['pid'])
#         if p_id == pid:
#             rev.append(product['profits']*sale['total_quantity'])
            
# rev

id
name
buying_price
selling_price
stock_quantity
new_sp
profits

,id,name,buying_price,selling_price,stock_quantity,new_sp,profits
0,1,blueband,200.0,210.0,50,250.00,40.00
1,2,kiwi,150.0,170.0,50,187.50,17.50
2,3,broadways,60.0,70.0,50,75.00,5.00
3,4,superloaf,55.0,65.0,50,68.75,3.75
4,5,lotion,200.0,250.0,50,250.00,0.00
...,...,...,...,...,...,...,...
102,103,"Lobster - Baby, Boiled",5.0,44.0,67,6.25,-37.75
103,104,Pate Pans Yellow,20.0,55.0,54,25.00,-30.00
104,105,Skirt - 24 Foot,24.0,6.0,85,30.00,24.00
105,106,Chambord Royal,8.0,60.0,71,10.00,-50.00
106,107,"Lamb - Racks, Frenched",6.0,64.0,91,7.50,-56.50